# 실행키 누름 : 인터프리터를 불러옴(개발자와 기계 사이에 상호작용을 도와줌)

# <입출력 함수>
# input() : 문자열 입력 함수
# print() : 화면 출력 함수
# print("텍스트1", end="텍스트2") : 텍스트1 화면 출력 + 끝부분에 텍스트2 출력
# print("{:3}".format("텍스트1"), end="텍스트2") : 텍스트1 무조건 3자리 차지 화면 출력 + 끝부분에 텍스트2 출력

# <변수>
# 파이썬은 한글 변수 사용 o
# 파이썬은 첫 글자 숫자 사용 x
# 파이썬은 모든 특수문자 사용 x(_제외)

# 메소드와 함수는 유사한 개념
# 특수 변수 _ : 마지막으로 발행된 표현식의 결과 저장

foo = input()
print(foo)
num1 = 10
asdfqwer = 2320
asdf_132 = 151321213515
QWEFASDVZXCVASDFWD = "Hello World"
변수 = "한글"
# 123fasdkfj = "Hello"
# foo!@#!@#!@$!@$!@$ = "hello"